OpenFOAM-v2106/tutorials/lagrangian/coalChemistryFoam/simplifiedSiwek/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 5390.5;

boundaryField
{
    top
    {
        type            epsilonWallFunction;
        value           uniform 5390.5;
    }

    bottom
    {
        type            epsilonWallFunction;
        value           uniform 5390.5;
    }

    walls
    {
        type            epsilonWallFunction;
        value           uniform 5390.5;
    }

    symmetry
    {
        type            symmetryPlane;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
